#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>
int main()
{
	/*一维数组*/
	int arr1[3] = { 1,2,3 };
	int* p1 = arr1;/*指向数组的首元素地址，使用中可以可以逐个访问数组的元素*/
	int(*pa1)[3] = &arr1;/*指向的是整个数组的地址,指针数组定义时要写大小[3]*/
		//一般数组名被解释为指向数组首元素地址，除了：
		//	1.sizeof操作符：当应用于数组名时，sizeof返回整个数组的大小而不是指向数组的指针的大小。
		//	2.地址运算符&：对数组名应用地址运算符&时，它将返回整个数组的地址，而不是第一个元素的地址。
		//	3.作为函数参数：当数组名作为函数参数时，它传递的是指向数组首元素的指针，但这不同于传递指针变量本身。
	printf("%p\n", p1 + 1);/*首元素地址+1，即下标为1的元素的地址*/
	printf("%p\n", &p1[1]);/*指针指向数组，指的是数组中下标为1的元素的地址*/
	printf("%p\n", &arr1 + 1);/*以数组长度为单位向后移动一个单位的地址*/

	
	/*二维数组*/
	int arr[2][3] = {1,2,3,4,5,6,};
	int(*ptr1)[3] = arr; /*指向包含三个整数的数组的指针，通过该指针可以访问二维数组的每一行*/
	int(*ptr2)[2][3] = &arr; /*指向具有完整维度的二维数组的指针*/
		/*和上述一维数组的数组指针类似*/
	int r = 2;
	int c = 3;
	int i = 0;
	int j = 0;
	/*int(*ptr1)[3] = arr;针对行*/
	for (i = 0; i < r; i++)
	{
		for (j = 0; j < c; j++)
		{
			//printf("%d ", *(*(ptr1 + i) + j));//
				//ptr1 + i,二维数组中arr[i]，即第i行的数组
				//*(ptr1 + i)是指向这行数组的指针
				//*(ptr1 + i)+j是在i行数组上首位元素位置增加 j 个偏移量，
				//*( *(ptr1 + i)+j)是上述i行j列的值，这里第一个*是解引用
			printf("%d ", ptr1[i][j]);/*因此用这种方式更简便*/
					}
		printf("\n");
	};

	/*int(*ptr2)[2][3] = &arr;针对整个数组*/
	for (i = 0; i < r; i++)
	{
		for (j = 0; j < c; j++)
		{
			//printf("%d ", *(*(*ptr2 + i) + j));//
				//*ptr2解引用ptr2,使其访问第一行，
				//*ptr2 + i,二维数组中arr[i]，即第i行的数组
				//(*ptr2 + i)+j是在i行数组上首位元素位置增加 j 个偏移量，
				//*( *(*ptr2 + i)+j)是上述i行j列的值，这里第一个*是解引用
			printf("%d ", (*ptr2)[i][j]);/*因此用这种方式更简便*/
		}
		printf("\n");
	};
	return 0;
}

//为什么取arr[i][j]的值
//①在int(*ptr2)[3] = arr    ，是   ptr2[i][j]或者 * (*( ptr1 + i) + j))
//②在int(*ptr2)[2][3] = &arr，是 * ptr2[i][j]或者 * (*(*ptr1 + i) + j))
//因为①指向的是行，②指向的是整个数组，
//②需要先*解引用，到和①一样的维度上，指向二维数组的行，获取到第一行的首个元素地址